MikeProStudio/nRF52840-Bluetooth-Sensor-Hub/src/main.c
#include <zephyr/kernel.h>
#include <zephyr/bluetooth/bluetooth.h>
#include <zephyr/bluetooth/conn.h>
#include <zephyr/bluetooth/uuid.h>
#include <zephyr/bluetooth/gatt.h>
#include <zephyr/bluetooth/hci.h>
#include <zephyr/bluetooth/hci_vs.h>
#include <zephyr/usb/usb_device.h>
#include <zephyr/settings/settings.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/sensor.h>
#include <zephyr/drivers/adc.h>
#include <zephyr/audio/dmic.h>
#include <zephyr/sys/byteorder.h>
#include <hal/nrf_power.h>
#include <hal/nrf_ficr.h>
#include <nfc_t2t_lib.h>
#include <nfc/ndef/uri_msg.h>
#include <nfc/ndef/le_oob_rec.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <zephyr/drivers/display.h>
#include "font8x8.h"
#include "qrcodegen.h"

/* --- Hardware Definitions --- */
#define LED0_NODE DT_ALIAS(led0)
#define LED1_NODE DT_ALIAS(led1)
#define LED2_NODE DT_ALIAS(led2)
static const struct gpio_dt_spec led_red_spec = GPIO_DT_SPEC_GET(LED0_NODE, gpios);
static const struct gpio_dt_spec led_green_spec = GPIO_DT_SPEC_GET(LED1_NODE, gpios);
static const struct gpio_dt_spec led_blue_spec = GPIO_DT_SPEC_GET(LED2_NODE, gpios);

const struct device *const imu_dev = DEVICE_DT_GET(DT_ALIAS(imu));
const struct device *const mic_dev = DEVICE_DT_GET(DT_ALIAS(mic));

/* GPIOs */
static const struct device *gpio0_dev = DEVICE_DT_GET(DT_NODELABEL(gpio0));
static const struct device *gpio1_dev = DEVICE_DT_GET(DT_NODELABEL(gpio1));

/* Pins */
#define SENSE_PWR_PIN 10 /* P1.10 - Sensor Power Enable */
#define READ_BAT_PIN  14 /* P0.14 - Battery Voltage Divider Enable (Active Low) */
#define CHG_STAT_PIN  17 /* P0.17 - BQ25100 /CHG Pin (Active Low) */
#define HICHG_PIN     13 /* P0.13 - High Charge Current Enable (Active Low) */

/* Battery Reading (ADC) */
static const struct adc_dt_spec adc_channel = ADC_DT_SPEC_GET_BY_IDX(DT_PATH(zephyr_user), 0);

/* --- BLE GATT Service --- */
#define BT_UUID_CUSTOM_SERVICE_VAL BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef0)
#define BT_UUID_ACCEL_CHRC_VAL     BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef1)
#define BT_UUID_GYRO_CHRC_VAL      BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef2)
#define BT_UUID_AUDIO_CHRC_VAL     BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef3)
#define BT_UUID_TX_POWER_CHRC_VAL  BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef4)
#define BT_UUID_BATTERY_CHRC_VAL   BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef5)
#define BT_UUID_RESET_CHRC_VAL     BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef6)

#define BT_UUID_CUSTOM_SERVICE  BT_UUID_DECLARE_128(BT_UUID_CUSTOM_SERVICE_VAL)
#define BT_UUID_ACCEL_CHRC      BT_UUID_DECLARE_128(BT_UUID_ACCEL_CHRC_VAL)
#define BT_UUID_GYRO_CHRC       BT_UUID_DECLARE_128(BT_UUID_GYRO_CHRC_VAL)
#define BT_UUID_AUDIO_CHRC      BT_UUID_DECLARE_128(BT_UUID_AUDIO_CHRC_VAL)
#define BT_UUID_TX_POWER_CHRC   BT_UUID_DECLARE_128(BT_UUID_TX_POWER_CHRC_VAL)
#define BT_UUID_BATTERY_CHRC    BT_UUID_DECLARE_128(BT_UUID_BATTERY_CHRC_VAL)
#define BT_UUID_RESET_CHRC      BT_UUID_DECLARE_128(BT_UUID_RESET_CHRC_VAL)

/* Sichere Indizes für GATT-Charakteristiken (verhindert Magic Numbers) */
enum {
	IDX_CUSTOM_SVC = 0,
	IDX_ACCEL_VAL = 2,
	IDX_GYRO_VAL = 5,
	IDX_AUDIO_VAL = 8,
	IDX_TX_POWER_VAL = 11,
	IDX_BATTERY_VAL = 14,
	IDX_RESET_VAL = 17,
};

/* Data structures for BLE transmission */
struct imu_data_t {
	uint8_t data[12]; /* 3x int32_t (x,y,z) serialized as LE */
};
struct batt_data_t {
    uint16_t voltage_mv;
    uint8_t soc;
    uint8_t status; /* 0=Discharging, 1=Charging, 2=USB Full */
} __packed;

static struct imu_data_t accel_data, gyro_data;
static uint8_t audio_level_buf[8]; /* uint32_t RMS + uint32_t ZCR */
static int8_t tx_power_level = 0; /* Default start value */
static struct batt_data_t battery_status = {0};

/* OLED Display (SSD1306 128x64, P0.04=SDA, P0.05=SCL, VCC=P1.11) */
#include <hal/nrf_gpio.h>
#define OLED_NODE DT_NODELABEL(ssd1306)
static const struct device *const oled_dev = DEVICE_DT_GET(OLED_NODE);
#define OLED_W 128
#define OLED_H 64
#define OLED_FB_SIZE (OLED_W * OLED_H / 8)
static uint8_t oled_fb[OLED_FB_SIZE];

/* Eigene preemptive Workqueue für OLED (Prio 4, niedriger als Audio-Thread Prio 2),
   damit Audio-Durchsatz nicht durch I2C-Bitbang-Updates blockiert wird */
static struct k_work_q oled_work_q;
K_THREAD_STACK_DEFINE(oled_work_q_stack, 2048);

/* VCC fuer OLED P1.11 via HAL vor allen anderen Treibern einschalten */
static int oled_vcc_init(void)
{
	nrf_gpio_cfg(43,
		     NRF_GPIO_PIN_DIR_OUTPUT,
		     NRF_GPIO_PIN_INPUT_DISCONNECT,
		     NRF_GPIO_PIN_NOPULL,
		     NRF_GPIO_PIN_H0H1,
		     NRF_GPIO_PIN_NOSENSE);
	nrf_gpio_pin_set(43);
	return 0;
}
SYS_INIT(oled_vcc_init, POST_KERNEL, 70);

/* Forward Declarations */
static void read_battery_voltage_impl(void);
static void update_tx_power_based_on_battery_impl(void);
static void start_advertising(void);

/* OLED + BT state */
static bool bt_connected_flag;
static uint8_t oled_phase;
static struct k_work_delayable oled_work;
static uint8_t oled_sub_phase;
static uint64_t imu_view_start;
static uint64_t mic_view_start;

/* Phase definitions */
#define PHASE_WELCOME   0
#define PHASE_BEACON    1
#define PHASE_QR        2
#define PHASE_CONNECTED 3

/* QR Code */
#define QR_VERSION 5
#define QR_BUF_LEN qrcodegen_BUFFER_LEN_FOR_VERSION(QR_VERSION)
static uint8_t qr_temp_buf[QR_BUF_LEN];
static uint8_t qr_code_buf[QR_BUF_LEN];
static bool qr_code_ready;
static uint64_t qr_view_start;

/* --- Power Management (Asynchron) --- */
static struct k_work_delayable batt_work;
static struct k_work_delayable status_work;
static uint8_t last_power_status = 255;

static void status_work_handler(struct k_work *work)
{
	uint8_t current_status = 0;
	if (gpio_pin_configure(gpio0_dev, CHG_STAT_PIN, GPIO_INPUT | GPIO_PULL_UP) == 0) {
		bool is_charging = (gpio_pin_get(gpio0_dev, CHG_STAT_PIN) == 0);
		bool vbus_present = (nrf_power_usbregstatus_get(NRF_POWER) & NRF_POWER_USBREGSTATUS_VBUSDETECT_MASK);

		if (is_charging) {
			current_status = 1; /* Charging */
			gpio_pin_configure(gpio0_dev, HICHG_PIN, GPIO_OUTPUT_HIGH); 
		} else if (vbus_present) {
			current_status = 2; /* USB Power / Full */
			gpio_pin_configure(gpio0_dev, HICHG_PIN, GPIO_OUTPUT_LOW);
		} else {
			current_status = 0; /* Battery Mode */
			gpio_pin_configure(gpio0_dev, HICHG_PIN, GPIO_OUTPUT_LOW);
		}
	}
	
	/* Notify immediately if status changes */
	if (current_status != last_power_status) {
		battery_status.status = current_status;
		last_power_status = current_status;
		update_tx_power_based_on_battery_impl();
	}
	/* Poll state every 1 second */
	k_work_reschedule(&status_work, K_SECONDS(1));
}

static void batt_work_handler(struct k_work *work)
{
	read_battery_voltage_impl();
	update_tx_power_based_on_battery_impl();
	
