MikeProStudio/nRF52840-Bluetooth-Sensor-Hub/src/main.c
		/* SoC Logic: 3.3V to 4.15V LiPo range */
		if (val_mv >= 4150) battery_status.soc = 100;
		else if (val_mv <= 3300) battery_status.soc = 0;
		else battery_status.soc = (uint8_t)((val_mv - 3300) * 100 / (4150 - 3300));
	}
}

static void update_tx_power_based_on_battery_impl(void)
{
	/* High power if > 20% OR on external power */
	int8_t target_power;
	if (battery_status.soc < 20 && battery_status.status == 0) {
		target_power = -4;
	} else {
		target_power = 8;
	}
	
	if (tx_power_level != target_power) {
		printk("Power Logic: SoC %d%% Status %d -> Set TX %d dBm\n", 
			battery_status.soc, battery_status.status, target_power);
		set_bt_tx_power(target_power);
	}

	/* Notify Battery Data */
	bt_gatt_notify(NULL, &custom_svc.attrs[IDX_BATTERY_VAL], &battery_status, sizeof(battery_status));
}

static uint32_t generated_passkey = 0;
static char device_name_with_pin[32] = "Skynet AI Beacon";

static struct bt_data ad[] = {
	BT_DATA_BYTES(BT_DATA_FLAGS, (BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR)),
	BT_DATA(BT_DATA_NAME_COMPLETE, device_name_with_pin, 16) /* Name ins Hauptpaket für Smartphones */
};

static struct bt_data sd[] = {
	BT_DATA_BYTES(BT_DATA_UUID128_ALL, BT_UUID_CUSTOM_SERVICE_VAL), /* UUID ins Scan-Response */
};

/* Forward reference for advertising work */
static struct k_work adv_start_work;
static void adv_start_handler(struct k_work *work);

static void connected(struct bt_conn *conn, uint8_t err)
{
	if (err) {
		printk("Connection failed (err 0x%02x)\n", err);
	} else {
		printk("Connected.\n");
		bt_connected_flag = true;
		oled_phase = PHASE_CONNECTED;
		oled_sub_phase = 0;
		imu_view_start = k_uptime_get();
		k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
	}
}

static void disconnected(struct bt_conn *conn, uint8_t reason)
{
	printk("Disconnected (reason 0x%02x)\n", reason);
	bt_connected_flag = false;
	oled_phase = PHASE_BEACON;
	oled_sub_phase = 0;
	k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
	start_advertising();
}

BT_CONN_CB_DEFINE(conn_callbacks) = {
	.connected = connected,
	.disconnected = disconnected,
};

static void phy_update(struct bt_conn *conn, struct bt_conn_le_phy_info *param)
{
	printk("PHY update: TX PHY %d, RX PHY %d\n", param->tx_phy, param->rx_phy);
}

static struct bt_conn_cb conn_callbacks_phy = {
	.le_phy_updated = phy_update,
};

static void start_advertising(void)
{
	struct bt_le_adv_param adv_param = {
		.id = BT_ID_DEFAULT,
		.sid = 0,
		.options = (1UL << 0) | (1UL << 2), /* BT_LE_ADV_OPT_CONNECTABLE | BT_LE_ADV_OPT_USE_NAME */
		.interval_min = BT_GAP_ADV_FAST_INT_MIN_2,
		.interval_max = BT_GAP_ADV_FAST_INT_MAX_2,
	};

	int err = bt_le_adv_start(&adv_param, ad, ARRAY_SIZE(ad), sd, ARRAY_SIZE(sd));
	if (err) {
		if (err != -EALREADY) {
			printk("Advertising failed to start (err %d)\n", err);
		}
	} else {
		printk("Advertising started. Skynet Beacon is visible.\n");
	}
}

static void adv_start_handler(struct k_work *work)
{
	start_advertising();
}

static void bt_ready_init(void)
{
		/* RGB Startup Sequence: R->G->B fade pulse, 10 cycles */
	for (int i = 0; i < 10; i++) {
		const struct gpio_dt_spec *specs[] = {&led_red_spec, &led_green_spec, &led_blue_spec};
		for (int s = 0; s < 3; s++) {
			if (!gpio_is_ready_dt(specs[s])) continue;

			/* Pseudo-fade using quick pulses (approx 75ms total per color) */
			for (int j = 0; j < 8; j++) { /* Fade Up */
				gpio_pin_set_dt(specs[s], 1);
				k_usleep(j * 550);
				gpio_pin_set_dt(specs[s], 0);
				k_usleep((8 - j) * 550);
			}
			gpio_pin_set_dt(specs[s], 1);
			k_msleep(15); /* Peak */
			for (int j = 8; j > 0; j--) { /* Fade Down */
				gpio_pin_set_dt(specs[s], 1);
				k_usleep(j * 550);
				gpio_pin_set_dt(specs[s], 0);
				k_usleep((8 - j) * 550);
			}
			gpio_pin_set_dt(specs[s], 0);
			k_msleep(50); /* Gap */
		}
	}	

	set_bt_tx_power(8);

	snprintf(device_name_with_pin, sizeof(device_name_with_pin), "Skynet AI Beacon");
	ad[1].data_len = strlen(device_name_with_pin);

	printk("************************************************\n");
	printk("SECURITY: Passkey Display (L4) enabled\n");
	printk("************************************************\n");

	start_advertising();
}

static int32_t my_sensor_value_to_milli(const struct sensor_value *val) { return (val->val1 * 1000) + (val->val2 / 1000); }

/* --- Audio Thread --- */
#define AUDIO_SAMPLE_RATE 16000
#define AUDIO_SAMPLES_PER_BLOCK 512
#define AUDIO_BLOCK_SIZE (AUDIO_SAMPLES_PER_BLOCK * sizeof(int16_t))
K_MEM_SLAB_DEFINE(audio_mem_slab, AUDIO_BLOCK_SIZE, 24, 4);

static struct k_thread audio_thread_data;
static struct k_thread sensor_thread_data;
K_THREAD_STACK_DEFINE(audio_stack, 2048);
K_THREAD_STACK_DEFINE(sensor_stack, 2048);

static void audio_thread(void *p1, void *p2, void *p3)
{
	void *buffer;
	size_t size;
	int ret;
	uint32_t val_u32;

	if (device_is_ready(gpio1_dev)) {
		gpio_pin_configure(gpio1_dev, SENSE_PWR_PIN, GPIO_OUTPUT_HIGH);
		gpio_pin_set(gpio1_dev, SENSE_PWR_PIN, 1);
		k_msleep(100);
	} else {
		printk("AUDIO: gpio1_dev not ready\n");
	}

	if (!device_is_ready(mic_dev)) {
		printk("AUDIO: mic_dev not ready\n");
		return;
	}

	struct pcm_stream_cfg stream_cfg = {
		.pcm_rate = AUDIO_SAMPLE_RATE,
		.pcm_width = 16,
		.block_size = AUDIO_BLOCK_SIZE,
		.mem_slab = &audio_mem_slab,
	};

	struct dmic_cfg cfg;
	memset(&cfg, 0, sizeof(cfg));
	cfg.io.min_pdm_clk_freq = 1000000;
	cfg.io.max_pdm_clk_freq = 3200000;
	cfg.streams = &stream_cfg;
	cfg.channel.req_chan_map_lo = dmic_build_channel_map(0, 0, PDM_CHAN_LEFT);
	cfg.channel.req_num_chan = 1;
	cfg.channel.req_num_streams = 1;

	if (dmic_configure(mic_dev, &cfg) < 0) {
		printk("AUDIO: dmic_configure failed\n");
		return;
	}
	if (dmic_trigger(mic_dev, DMIC_TRIGGER_START) < 0) {
		printk("AUDIO: dmic_trigger failed\n");
		return;
	}
	printk("AUDIO: PDM started, waiting for samples\n");

	while (1) {
		ret = dmic_read(mic_dev, 0, &buffer, &size, SYS_FOREVER_MS);
		if (ret != 0) {
			printk("DMIC Read Error: %d\n", ret);
			k_msleep(10);
			continue;
		}
		
		if (ret == 0) {
			int16_t *samples = (int16_t *)buffer;
			uint32_t count = size / sizeof(int16_t);
			
			double sum_sq = 0;
			uint32_t zero_crossings = 0;
			int16_t last_sample = 0;

			for (uint32_t i = 0; i < count; i++) {
				/* RMS Calculation */
				double val = (double)samples[i] / 32768.0;
				sum_sq += val * val;

				/* Zero-Crossing Rate (ZCR) Calculation */
				/* Check if the sign changed compared to the last sample, ignore exactly 0 to avoid noise jitter */
				if (i > 0) {
					if ((samples[i] > 0 && last_sample < 0) || (samples[i] < 0 && last_sample > 0)) {
						zero_crossings++;
					}
				}
				last_sample = samples[i];
			}
			
			double rms = sqrt(sum_sq / (double)count);
			
			/* Pack data for BLE: [4 bytes RMS] [4 bytes ZCR] */
			val_u32 = (uint32_t)(rms * 1000.0);
			sys_put_le32(val_u32, &audio_level_buf[0]);
			sys_put_le32(zero_crossings, &audio_level_buf[4]);
			
			/* RGB LED Audio Logic (Highly Smoothed for Fade-out effect) */
			static double smoothed_rms = 0.0;
			const double decay_factor = 0.885; /* Very slow fade-out */
			const double attack_factor = 0.12; /* Smoother build-up */

			if (rms > smoothed_rms) {
				smoothed_rms = (attack_factor * rms) + ((1.0 - attack_factor) * smoothed_rms);
			} else {
				smoothed_rms *= decay_factor;
			}

			if (gpio_is_ready_dt(&led_red_spec) && gpio_is_ready_dt(&led_green_spec) && gpio_is_ready_dt(&led_blue_spec)) {
				if (smoothed_rms < 0.004) { /* Silence */
					gpio_pin_set_dt(&led_red_spec, 0); gpio_pin_set_dt(&led_green_spec, 0); gpio_pin_set_dt(&led_blue_spec, 0);
				} else if (smoothed_rms < 0.012) { /* Low: Cyan/Blue */
					gpio_pin_set_dt(&led_red_spec, 0); gpio_pin_set_dt(&led_green_spec, 1); gpio_pin_set_dt(&led_blue_spec, 1);
				} else if (smoothed_rms < 0.025) { /* Mid: Green */
					gpio_pin_set_dt(&led_red_spec, 0); gpio_pin_set_dt(&led_green_spec, 1); gpio_pin_set_dt(&led_blue_spec, 0);
				} else if (smoothed_rms < 0.045) { /* High: Yellow */
					gpio_pin_set_dt(&led_red_spec, 1); gpio_pin_set_dt(&led_green_spec, 1); gpio_pin_set_dt(&led_blue_spec, 0);
				} else { /* Peak: Red */
					gpio_pin_set_dt(&led_red_spec, 1); gpio_pin_set_dt(&led_green_spec, 0); gpio_pin_set_dt(&led_blue_spec, 0);
				}
			}

			if (bt_connected_flag) {
				bt_gatt_notify(NULL, &custom_svc.attrs[IDX_AUDIO_VAL], audio_level_buf, sizeof(audio_level_buf));
			}
			k_mem_slab_free(&audio_mem_slab, buffer);
			if (k_uptime_get_32() % 1000 < 50) {
				printk("Mic RMS: %u\n", val_u32);
			}
		}
	}
}

static void sensor_thread(void *p1, void *p2, void *p3)
{
	struct sensor_value accel[3], gyro[3];
	int32_t ax, ay, az, gx, gy, gz;

