MikeProStudio/nRF52840-Bluetooth-Sensor-Hub/src/main.c
	if (device_is_ready(imu_dev)) {
		struct sensor_value odr = { .val1 = 52, .val2 = 0 };
		sensor_attr_set(imu_dev, SENSOR_CHAN_ACCEL_XYZ, SENSOR_ATTR_SAMPLING_FREQUENCY, &odr);
		sensor_attr_set(imu_dev, SENSOR_CHAN_GYRO_XYZ, SENSOR_ATTR_SAMPLING_FREQUENCY, &odr);
	}

	while (1) {
		if (sensor_sample_fetch(imu_dev) == 0) {
			sensor_channel_get(imu_dev, SENSOR_CHAN_ACCEL_XYZ, accel);
			sensor_channel_get(imu_dev, SENSOR_CHAN_GYRO_XYZ, gyro);
			
			ax = my_sensor_value_to_milli(&accel[0]);
			ay = my_sensor_value_to_milli(&accel[1]);
			az = my_sensor_value_to_milli(&accel[2]);
			gx = my_sensor_value_to_milli(&gyro[0]);
			gy = my_sensor_value_to_milli(&gyro[1]);
			gz = my_sensor_value_to_milli(&gyro[2]);
			
			sys_put_le32(ax, &accel_data.data[0]);
			sys_put_le32(ay, &accel_data.data[4]);
			sys_put_le32(az, &accel_data.data[8]);
			sys_put_le32(gx, &gyro_data.data[0]);
			sys_put_le32(gy, &gyro_data.data[4]);
			sys_put_le32(gz, &gyro_data.data[8]);
			
			bt_gatt_notify(NULL, &custom_svc.attrs[IDX_ACCEL_VAL], &accel_data, sizeof(accel_data));
			bt_gatt_notify(NULL, &custom_svc.attrs[IDX_GYRO_VAL], &gyro_data, sizeof(gyro_data));
		}
		k_msleep(20); /* Wiederhergestellt auf 50Hz wie vom User gewünscht */
	}
}

/* --- NFC Logic --- */
static uint8_t nfc_ndef_msg_buf[256]; /* Vergrößert auf 256 Bytes */

static void nfc_callback(void *context, nfc_t2t_event_t event, const uint8_t *data, size_t data_len)
{
	switch (event) {
	case NFC_T2T_EVENT_FIELD_ON:
		printk("NFC: Field detected (Smartphone nearby)\n");
		break;
	case NFC_T2T_EVENT_FIELD_OFF:
		printk("NFC: Field lost\n");
		break;
	default:
		break;
	}
}

static int setup_nfc(void)
{
	int err;
	size_t len = sizeof(nfc_ndef_msg_buf);

	err = nfc_t2t_setup(nfc_callback, NULL);
	if (err) {
		printk("NFC setup failed (err %d)\n", err);
		return err;
	}

	/* Create URI Record with dynamic PIN */
	char url[128];
	snprintf(url, sizeof(url), "mikeprostudio.github.io/nRF52840-Bluetooth-Sensor-Hub/?pin=%06u", generated_passkey);

	err = nfc_ndef_uri_msg_encode(NFC_URI_HTTPS, url, strlen(url), nfc_ndef_msg_buf, &len);
	if (err) {
		printk("NFC NDEF encode failed (err %d)\n", err);
		return err;
	}

	err = nfc_t2t_payload_set(nfc_ndef_msg_buf, len);
	if (err) {
		printk("NFC payload set failed (err %d)\n", err);
		return err;
	}

	err = nfc_t2t_emulation_start();
	if (err) {
		printk("NFC emulation start failed (err %d)\n", err);
		return err;
	}

	printk("NFC URI Tag ready. URL: https://%s\n", url);
	return 0;
}

/* --- OLED Display Functions --- */
static void oled_set_pixel(uint16_t x, uint16_t y, uint8_t on)
{
	if (x >= OLED_W || y >= OLED_H) return;
	uint16_t page = y / 8;
	uint8_t bit = y % 8;
	uint16_t idx = page * OLED_W + x;
	if (on) oled_fb[idx] |= (1 << bit);
	else    oled_fb[idx] &= ~(1 << bit);
}

static void oled_putc_w(uint16_t x, uint16_t y, char c, uint8_t w)
{
	if (c < 0x20 || c > 0x7E) c = ' ';
	if (w > 8) w = 8;
	uint8_t idx = c - 0x20;
	for (int row = 0; row < 8 && (y + row) < OLED_H; row++) {
		uint8_t bits = font8x8[idx][row];
		for (int col = 0; col < w && (x + col) < OLED_W; col++) {
			if (bits & (1 << (7 - col)))
				oled_set_pixel(x + col, y + row, 1);
		}
	}
}

static void oled_puts_w(uint16_t x, uint16_t y, const char *str, uint8_t w)
{
	while (*str) {
		oled_putc_w(x, y, *str, w);
		x += w;
		if (x + w > OLED_W) { x = 0; y += 8; }
		str++;
	}
}

static void oled_putc(uint16_t x, uint16_t y, char c)
{
	oled_putc_w(x, y, c, 8);
}

static void oled_puts(uint16_t x, uint16_t y, const char *str)
{
	oled_puts_w(x, y, str, 8);
}

static void oled_clear(void)
{
	memset(oled_fb, 0, sizeof(oled_fb));
}

static void oled_flush(void)
{
	struct display_buffer_descriptor desc = {
		.width = OLED_W,
		.height = OLED_H,
		.pitch = OLED_W,
		.buf_size = OLED_FB_SIZE,
	};
	display_write(oled_dev, 0, 0, &desc, oled_fb);
}

static int oled_init(void)
{
	if (!device_is_ready(oled_dev)) {
		printk("OLED device not ready\n");
		return -ENODEV;
	}
	display_blanking_off(oled_dev);
	oled_clear();
	oled_flush();
	if (IS_ENABLED(CONFIG_LOG)) printk("OLED initialized\n");
	return 0;
}

/* --- QR Code --- */
static void generate_qr_code(void)
{
	char url[96];
	snprintf(url, sizeof(url), "https://mikeprostudio.github.io/nRF52840-Bluetooth-Sensor-Hub/");
	qr_code_ready = qrcodegen_encodeText(url, qr_temp_buf, qr_code_buf,
	                                      qrcodegen_Ecc_LOW, 1, QR_VERSION, qrcodegen_Mask_AUTO, true);
}

static void oled_draw_qr_code(void)
{
	char buf[24];

	oled_clear();

	if (qr_code_ready) {
		int size = qrcodegen_getSize(qr_code_buf);
		int module_px = 2;
		int qr_pixels = size * module_px;
		int qr_x = 2, qr_y = (OLED_H - qr_pixels) / 2;
		for (int my = 0; my < size; my++) {
			for (int mx = 0; mx < size; mx++) {
				if (qrcodegen_getModule(qr_code_buf, mx, my)) {
					for (int dy = 0; dy < module_px; dy++) {
						for (int dx = 0; dx < module_px; dx++) {
							oled_set_pixel(qr_x + mx * module_px + dx, qr_y + my * module_px + dy, 1);
						}
					}
				}
			}
		}
	}

	int pin_x = (qr_code_ready && qrcodegen_getSize(qr_code_buf) * 2 + 2 < OLED_W)
	            ? qrcodegen_getSize(qr_code_buf) * 2 + 8 : OLED_W - 48;
	oled_puts(pin_x, (OLED_H - 16) / 2, "PIN:");
	snprintf(buf, sizeof(buf), "%06u", generated_passkey);
	oled_puts(pin_x, (OLED_H - 16) / 2 + 12, buf);

	oled_flush();
}

static void oled_update_display(void)
{
	char buf[24];

	oled_clear();

	snprintf(buf, sizeof(buf), "Skynet AI Beacon");
	oled_puts(0, 0, buf);

	snprintf(buf, sizeof(buf), "PIN: %06u", generated_passkey);
	oled_puts(0, 16, buf);

	snprintf(buf, sizeof(buf), "BAT: %umV %u%%", battery_status.voltage_mv, battery_status.soc);
	oled_puts(0, 32, buf);

	const char *status_str;
	switch (battery_status.status) {
	case 1:  status_str = "Charging";   break;
	case 2:  status_str = "USB Power";  break;
	default: status_str = "Battery";    break;
	}
	snprintf(buf, sizeof(buf), "PWR: %s", status_str);
	oled_puts(0, 48, buf);

	oled_flush();
}

static void fmt_val(char *buf, int32_t val)
{
	int neg = (val < 0);
	if (neg) val = -val;
	int ip = val / 1000;
	int fp = (val % 1000 + 5) / 10;
	if (fp >= 100) { ip++; fp = 0; }
	snprintf(buf, 10, "%s%d.%02u", neg ? "-" : " ", ip, (unsigned int)fp);
}

/* --- OLED Mic PSD Visualization --- */
#define PSD_BINS 112
#define CHART_X 16
static uint8_t psd_ema[PSD_BINS];

