MikeProStudio/nRF52840-Bluetooth-Sensor-Hub/src/main.c
static void oled_update_mic(void)
{
	uint32_t rms_raw = sys_get_le32(&audio_level_buf[0]);
	uint32_t zcr = sys_get_le32(&audio_level_buf[4]);
	double rms = (double)rms_raw / 1000.0;
	double freq_est = (double)zcr * 8000.0 / 1024.0;
	if (freq_est < 300.0) freq_est = 300.0;

	double dbfs = 20.0 * log10(rms + 0.0001);
	double dbspl = dbfs + 135.0;
	if (dbspl < 30.0) dbspl = 30.0;
	if (dbspl > 120.0) dbspl = 120.0;
	double max_bar = (dbspl - 30.0) / 90.0 * 47.0;

	oled_clear();

	for (int i = 0; i < PSD_BINS; i++) {
		double bin_freq = (double)i * 16000.0 / (double)(PSD_BINS * 2);
		double dist = bin_freq - freq_est;
		double val = exp(-(dist * dist) / 40000.0) * max_bar;
		double dist2 = bin_freq - freq_est * 2.0;
		val += exp(-(dist2 * dist2) / 20000.0) * max_bar * 0.35;
		val += exp(-(bin_freq * bin_freq) / 20000.0) * max_bar * 0.12;
		if (val < 0.3) val = 0.0;
		if (val > 47.0) val = 47.0;
		uint8_t v = (uint8_t)val;

		uint8_t ema = (uint8_t)((v > psd_ema[i]) ?
			(v * 0.5f + psd_ema[i] * 0.5f) :
			(psd_ema[i] * 0.90f));
		if (ema > 47) ema = 47;
		psd_ema[i] = ema;

		for (int y = 0; y < ema && y < 48; y++) {
			oled_set_pixel(CHART_X + i, 47 - y, 1);
		}
	}

	oled_puts_w(0, 0, "120", 4);
	oled_puts_w(0, 20, "75", 4);
	oled_puts_w(0, 39, "30", 4);
	oled_puts_w(CHART_X, 48, "0  2  4  6  8kHz", 6);
	char rms_str[16];
	snprintf(rms_str, sizeof(rms_str), "RMS %u", rms_raw);
	oled_puts_w(0, 56, rms_str, 6);

	oled_flush();
}

static void oled_update_connected(void)
{
	char buf[24], xs[10], ys[10], zs[10];

	oled_clear();

	oled_puts(0, 0, "Skynet AI Beacon");

	int32_t ax = (int32_t)sys_get_le32(&accel_data.data[0]);
	int32_t ay = (int32_t)sys_get_le32(&accel_data.data[4]);
	int32_t az = (int32_t)sys_get_le32(&accel_data.data[8]);
	int32_t gx = (int32_t)sys_get_le32(&gyro_data.data[0]);
	int32_t gy = (int32_t)sys_get_le32(&gyro_data.data[4]);
	int32_t gz = (int32_t)sys_get_le32(&gyro_data.data[8]);

	fmt_val(xs, ax); fmt_val(ys, ay); fmt_val(zs, az);
	oled_puts_w(0, 10, "   X:      Y:      Z:", 6);
	snprintf(buf, sizeof(buf), "Acc %s %s %s", xs, ys, zs);
	oled_puts_w(0, 20, buf, 6);

	fmt_val(xs, gx); fmt_val(ys, gy); fmt_val(zs, gz);
	snprintf(buf, sizeof(buf), "Gyr %s %s %s", xs, ys, zs);
	oled_puts_w(0, 30, buf, 6);

	snprintf(buf, sizeof(buf), "BAT %umV %u%%", battery_status.voltage_mv, battery_status.soc);
	oled_puts_w(0, 42, buf, 6);

	const char *pwr;
	switch (battery_status.status) {
	case 1:  pwr = "Charging";   break;
	case 2:  pwr = "USB Power";  break;
	default: pwr = "Battery";    break;
	}
	snprintf(buf, sizeof(buf), "PWR %s", pwr);
	oled_puts_w(0, 52, buf, 6);

	oled_flush();
}

static void oled_work_handler(struct k_work *work)
{
	if (oled_phase == PHASE_WELCOME) {
		oled_clear();
		oled_puts(16, 24, "Welcome!");
		oled_flush();
		generate_qr_code();
		oled_phase = PHASE_QR;
		qr_view_start = k_uptime_get();
		oled_sub_phase = 0;
		k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_SECONDS(2));
	} else if (bt_connected_flag) {
		if (oled_sub_phase == 0) {
			oled_update_connected();
			if (k_uptime_get() - imu_view_start < 5000) {
				k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(150));
			} else {
				mic_view_start = k_uptime_get();
				oled_sub_phase = 1;
				k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(150));
			}
		} else {
			oled_update_mic();
			if (k_uptime_get() - mic_view_start < 5000) {
				k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(150));
			} else {
				imu_view_start = k_uptime_get();
				oled_sub_phase = 0;
				k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(150));
			}
		}
	} else if (oled_phase == PHASE_QR) {
		oled_draw_qr_code();
		if (k_uptime_get() - qr_view_start < 10000) {
			k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(500));
		} else {
			oled_phase = PHASE_BEACON;
			k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
		}
	} else {
		oled_update_display();
		oled_phase = PHASE_QR;
		oled_sub_phase = 0;
		qr_view_start = k_uptime_get();
		k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_SECONDS(2));
	}
}

int main(void) {
	if (gpio_is_ready_dt(&led_red_spec)) { gpio_pin_configure_dt(&led_red_spec, GPIO_OUTPUT_INACTIVE); }
	if (gpio_is_ready_dt(&led_green_spec)) { gpio_pin_configure_dt(&led_green_spec, GPIO_OUTPUT_INACTIVE); }
	if (gpio_is_ready_dt(&led_blue_spec)) { gpio_pin_configure_dt(&led_blue_spec, GPIO_OUTPUT_INACTIVE); }
	
	usb_enable(NULL);

	bt_conn_auth_cb_register(&auth_cb_display);
	bt_conn_auth_info_cb_register(&auth_info_cb);

	/* Generate a unique, constant 6-digit PIN from Hardware FICR DeviceAddress */
	generated_passkey = (nrf_ficr_deviceaddr_get(NRF_FICR, 0) % 900000) + 100000;
	bt_passkey_set(generated_passkey);
	printk("----------------------------------\n");
	printk("DEVICE UNIQUE PIN: %06u\n", generated_passkey);
	printk("----------------------------------\n");

	/* Settings müssen VOR bt_enable() geladen werden, damit die BT-Identität (BLE-Address)
	   aus NVS restaured wird und nach Power-Cycle gleich bleibt */
	if (IS_ENABLED(CONFIG_BT_SETTINGS)) {
		settings_load();
	}

	int err = bt_enable(NULL);
	if (err) {
		printk("Bluetooth init failed (err %d)\n", err);
		return 0;
	}

	bt_conn_cb_register(&conn_callbacks_phy);

	/* Initialize NFC after BT is ready so we can fetch the device address */
	setup_nfc();

	/* Initialize OLED display */
	oled_init();

	k_work_init(&adv_start_work, adv_start_handler);

	bt_ready_init();
	k_thread_create(&audio_thread_data, audio_stack, K_THREAD_STACK_SIZEOF(audio_stack), audio_thread, NULL, NULL, NULL, 2, K_FP_REGS, K_NO_WAIT);
	k_thread_create(&sensor_thread_data, sensor_stack, K_THREAD_STACK_SIZEOF(sensor_stack), sensor_thread, NULL, NULL, NULL, 3, K_FP_REGS, K_NO_WAIT);

	/* Initialize and start periodic battery monitoring */
	k_work_init_delayable(&batt_work, batt_work_handler);
	k_work_reschedule(&batt_work, K_NO_WAIT);

	/* Initialize and start periodic status monitoring */
	k_work_init_delayable(&status_work, status_work_handler);
	k_work_reschedule(&status_work, K_NO_WAIT);

	/* Initialize and start periodic OLED update */
	k_work_queue_start(&oled_work_q, oled_work_q_stack,
			   K_THREAD_STACK_SIZEOF(oled_work_q_stack),
			   4, NULL);
	k_work_init_delayable(&oled_work, oled_work_handler);
	k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_SECONDS(1));

	while (1) {
		/* The main loop is now very light, everything is handled by threads and workqueues.
		   We sleep for a longer time to save power. */
		k_msleep(1000);
	}
	return 0;
}
